app/views/invoices/_form.html.erb

SELECT "delivery_statuses".* FROM "delivery_statuses"
---
    <%= f.label :delivery_status_id %><br>
    <%= f.collection_select :delivery_status_id,DeliveryStatus.all,:id,:status_name, {:prompt => 'Please select delivery status'} %>