app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (product_name LIKE '%product_name%')
---
  def index
      @products = Product.all

INSERT INTO "products" ("product_name", "price", "amount_in_stock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_name", "1"], ["price", "1.0"], ["amount_in_stock", 1], ["created_at", "2016-04-19 18:44:26.200818"], ["updated_at", "2016-04-19 18:44:26.200818"]]
---
  def create

    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "product_unit_id" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["product_unit_id", 1], ["updated_at", "2016-04-19 18:55:34.426301"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)